01_DFSR/base_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 5 0 0 );

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        value           uniform ( 5 0 0 );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
        value           uniform ( 0 0 0 );
    }

    top
    {
        type            symmetry;
    }

    ground
    {
        type            uniformFixedValue;
        value           uniform (0 0 0);
        uniformValue    constant (0 0 0);
    }
	  roughnessBlocks
    {
        type            uniformFixedValue;
        value           uniform (0 0 0);
        uniformValue    constant (0 0 0);
    }

    front
    {
        type            symmetry;
    }

    back
    {
        type            symmetry;
    }
}


// ************************************************************************* //
