01_DFSR/base_case/system/inflowGenerationDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  21.12                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 21.12;
format ascii;
class dictionary;
location "constant";
object random;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// tProfile.rampProfile(tRamp=10.0)
// uProfile.ECProfile(Ubas=5.6,z0=0.03,kt=0.18,zMin=1.0,scale=400.0)
// sProfile.ECProfile(Ubas=5.6,kt=0.18)
// lProfile.ESDUProfile(z0=0.03,scale=400.0)
// Covariance = [1.000 0.000 0.000]
//              [0.000 0.562 0.000]
//              [0.000 0.000 0.250]
// L          = [1.000 0.600 0.400]
//              [0.600 0.500 0.300]
//              [0.350 0.250 0.200]
// dEd = 5
// finalE = 0.95

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cutOff 0.5; 

seeds (0.113
0.253
0.530
0.833
1.225
1.750
2.750);

tProfile (
(0.000 0.000 1.000)
(10.000 1.000 1.000)
);

uProfile (
(0.000 3.535 1.000)
(0.070 6.893 1.000)
(0.140 7.592 1.000)
(0.210 8.001 1.000)
(0.280 8.291 1.000)
(0.350 8.516 1.000)
(0.420 8.700 1.000)
(0.490 8.855 1.000)
(0.560 8.990 1.000)
(0.630 9.108 1.000)
(0.700 9.214 1.000)
(0.770 9.311 1.000)
(0.840 9.398 1.000)
(0.910 9.479 1.000)
(0.980 9.554 1.000)
(1.050 9.623 1.000)
(1.120 9.688 1.000)
(1.190 9.749 1.000)
(1.260 9.807 1.000)
(1.330 9.861 1.000)
(1.400 9.913 1.000)
(1.470 9.962 1.000)
(1.540 10.009 1.000)
(1.610 10.054 1.000)
(1.680 10.097 1.000)
(1.750 10.138 1.000)
(1.820 10.178 1.000)
(1.890 10.216 1.000)
(1.960 10.252 1.000)
(2.030 10.288 1.000)
(2.100 10.322 1.000)
(2.170 10.355 1.000)
(2.240 10.387 1.000)
(2.310 10.418 1.000)
(2.380 10.448 1.000)
(2.450 10.477 1.000)
(2.520 10.506 1.000)
(2.590 10.533 1.000)
(2.660 10.560 1.000)
(2.730 10.586 1.000)
(2.800 10.612 1.000)
(2.870 10.637 1.000)
(2.940 10.661 1.000)
(3.010 10.685 1.000)
(3.080 10.708 1.000)
(3.150 10.731 1.000)
(3.220 10.753 1.000)
(3.290 10.774 1.000)
(3.360 10.796 1.000)
(3.430 10.816 1.000)
(3.500 10.837 1.000)
);

sProfile (
(0.000 1.008 1.000)
(0.070 1.008 1.000)
(0.140 1.008 1.000)
(0.210 1.008 1.000)
(0.280 1.008 1.000)
(0.350 1.008 1.000)
(0.420 1.008 1.000)
(0.490 1.008 1.000)
(0.560 1.008 1.000)
(0.630 1.008 1.000)
(0.700 1.008 1.000)
(0.770 1.008 1.000)
(0.840 1.008 1.000)
(0.910 1.008 1.000)
(0.980 1.008 1.000)
(1.050 1.008 1.000)
(1.120 1.008 1.000)
(1.190 1.008 1.000)
(1.260 1.008 1.000)
(1.330 1.008 1.000)
(1.400 1.008 1.000)
(1.470 1.008 1.000)
(1.540 1.008 1.000)
(1.610 1.008 1.000)
(1.680 1.008 1.000)
(1.750 1.008 1.000)
(1.820 1.008 1.000)
(1.890 1.008 1.000)
(1.960 1.008 1.000)
(2.030 1.008 1.000)
(2.100 1.008 1.000)
(2.170 1.008 1.000)
(2.240 1.008 1.000)
(2.310 1.008 1.000)
(2.380 1.008 1.000)
(2.450 1.008 1.000)
(2.520 1.008 1.000)
(2.590 1.008 1.000)
(2.660 1.008 1.000)
(2.730 1.008 1.000)
(2.800 1.008 1.000)
(2.870 1.008 1.000)
(2.940 1.008 1.000)
(3.010 1.008 1.000)
(3.080 1.008 1.000)
(3.150 1.008 1.000)
(3.220 1.008 1.000)
(3.290 1.008 1.000)
(3.360 1.008 1.000)
(3.430 1.008 1.000)
(3.500 1.008 1.000)
);

lProfile (
(0.000 0.049 1.000)
(0.070 0.250 1.000)
(0.140 0.319 1.000)
(0.210 0.368 1.000)
(0.280 0.406 1.000)
(0.350 0.440 1.000)
(0.420 0.468 1.000)
(0.490 0.494 1.000)
(0.560 0.518 1.000)
(0.630 0.540 1.000)
(0.700 0.560 1.000)
(0.770 0.579 1.000)
(0.840 0.597 1.000)
(0.910 0.614 1.000)
(0.980 0.630 1.000)
(1.050 0.646 1.000)
(1.120 0.660 1.000)
(1.190 0.675 1.000)
(1.260 0.688 1.000)
(1.330 0.701 1.000)
(1.400 0.714 1.000)
(1.470 0.726 1.000)
(1.540 0.738 1.000)
(1.610 0.750 1.000)
(1.680 0.761 1.000)
(1.750 0.772 1.000)
(1.820 0.783 1.000)
(1.890 0.793 1.000)
(1.960 0.803 1.000)
(2.030 0.813 1.000)
(2.100 0.823 1.000)
(2.170 0.832 1.000)
(2.240 0.842 1.000)
(2.310 0.851 1.000)
(2.380 0.860 1.000)
(2.450 0.868 1.000)
(2.520 0.877 1.000)
(2.590 0.886 1.000)
(2.660 0.894 1.000)
(2.730 0.902 1.000)
(2.800 0.910 1.000)
(2.870 0.918 1.000)
(2.940 0.926 1.000)
(3.010 0.933 1.000)
(3.080 0.941 1.000)
(3.150 0.948 1.000)
(3.220 0.956 1.000)
(3.290 0.963 1.000)
(3.360 0.970 1.000)
(3.430 0.977 1.000)
(3.500 0.984 1.000)
);

kMainSeed ( 
(-0.01726811326983105 0.05532866003376271 0.06278199508859564)
(0.0023118943504665313 -0.004487752705358731 0.02859879625054219)
(0.01190113723468136 0.05099122736416327 0.21182370844011855)
(0.05709869797262717 0.07672199796357537 0.47087362811027983)
(0.040806052178784746 0.0640628795085342 -0.3344006097346519)
(-0.010879901883718445 -0.021565129533216938 -0.09673895811866873)
(0.002697410709970712 -0.01782034982930175 0.05349065599806918)
(0.04942779593202014 0.05850873997142149 0.3373722853203535)
(0.05626647846207262 0.057664553783685416 -0.3624701119361277)
(0.024772450422955283 0.007979989911136073 -0.1180819707168986)
(-0.0009861084262074115 -0.00629586176528892 0.013262711934059479)
(-0.0185498116134816 0.08876799572957915 -0.15614288260001516)
(-0.0471925362515168 0.12696965783649908 0.5117043166872062)
(-0.03536191851995502 0.10769580564854235 -0.41702313446822376)
(-0.022307841353492893 0.0751410942499059 0.2616853183137103)
(0.05506128901786215 0.1174079923285632 0.4694288540980355)
(-0.011283589489159787 -0.0561034268893492 -0.16652144556421056)
(-0.021576601759265467 -0.08132235000409851 0.2593620751707312)
(-0.012542070915082592 -0.04352583643200046 0.14231069307203967)
(0.012218710961920135 0.04855122327712546 0.15233142278293452)
(-0.04807567064302616 0.1283622530307041 0.0947364616030098)
(-0.015061270165402624 0.06031234430783517 0.08489702463882717)
(-0.04263661630331939 0.19414910469491167 0.29044398951939643)
(-0.0021213488290198613 -0.06542355056697055 -0.15169458516006062)
(0.06686238191612019 -0.22274129055279704 0.6803643904511542)
(0.0036797128096261278 0.04464082008780141 -0.10113956996933252)
(0.06481857250295539 0.18853617276485057 0.5738650205631186)
(0.05007442928297679 -0.14747171166236664 -0.4452023652437265)
(0.005098760773767854 -0.04515658388968925 0.10481515615950537)
(0.023487002246359117 -0.10169790930059482 -0.2728768058021662)
(-0.06538410335895378 -0.16653714097968553 0.10281486698583808)
(0.053879273453130816 -0.14663530432877675 0.11450934541094468)
(-0.04784884388791827 -0.27198416720507596 -0.3998773206625317)
(-0.019141510570710625 0.362277449017581 0.6323854006960401)
(0.005715102850816516 0.5510770531810947 0.9706553197883071)
(0.007730981853939303 -0.11434292113397797 -0.21857209817359755)
(0.012512356414781158 0.12879069096573104 0.2528891493119213)
(-0.055032611347906546 -0.22201251123000793 0.5200174474444875)
(0.0632117151623167 -0.2385082389171405 0.5688788673362524)
(0.05952406411214585 0.21608051592811858 0.5210959739689058)
(-0.03338766005448187 0.08222938112047697 0.04330066236577476)
(0.02866152065216872 -0.10792263619439697 -0.11579501420956202)
(0.013131901696366433 -0.09955830425230819 0.14389957514555946)
(0.018137572967940222 -0.2079860033104773 -0.3037280127224839)
(-0.03673903920071978 0.7600853206133195 1.292702581042107)
(-0.019844866647093125 0.3103455929069055 0.5221177966794601)
(-0.0060099742265493136 -0.13549442942948875 0.2191768940269969)
(0.04495689457321806 0.3022108209984701 -0.5572963254707911)
(-0.007357740817579313 0.11568191631959715 -0.1913174211676641)
(-0.008497424698403077 -0.11121190216348815 0.1870808259636941)
(-0.027960625792300135 -0.09120417426097081 0.07854696656028215)
(0.04075523771036965 -0.15222967493739986 -0.15252903260159165)
(-0.008425538525212729 -0.07012037054980283 0.09711033125176227)
(-0.07036190380653135 -0.38508353866113526 -0.43705676414530803)
(-0.034447574731814326 -0.5314767611970506 -0.711087212872127)
(0.019682674849706365 0.9617449743722181 -1.4208780127956502)
(-0.045057521624577414 -0.4753477756869007 -0.7668700729722568)
(-0.05462159844533492 -0.48236637558815726 0.7936690707630348)
(-0.042197141517769154 0.3543354970699467 0.5868120421217531)
(-0.02086629139754589 -0.2300730837044307 0.3676382556002084)
(-0.03054791998846557 -0.09161561436425585 -0.0683283710599361)
(-0.07744876372559464 -0.22862919854294572 0.1723779011501425)
(-0.05258614113588814 -0.20218913921541715 -0.19626826590262053)
(0.046264397877386065 0.2492680508819103 0.27326382898178125)
(0.0811657896320629 0.5335825336094656 0.5940799989376712)
(-0.06664867915140103 1.2296848702830065 1.5766784890439056)
(-0.015090798248857696 1.6299048371002436 2.2715690065865006)
(-0.03434296189848422 0.5949877378084791 -0.8838965130771862)
(-0.08066935699769949 -0.6299502930455363 1.0234604276765356)
(0.008087859080583055 -0.178299560774336 -0.26029657953343804)
(0.03091741474284581 0.0993762445763766 0.08115379939303842)
(0.042555833393917296 -0.14086136182154144 -0.12124267637009659)
(0.06687030268066584 -0.25354896938638666 -0.24149010806735863)
(-0.028443390255152582 0.18394199174080608 -0.2129408690862588)
(0.07894326991609328 0.4698031111674612 0.5026747152418398)
(-0.01406234477114314 0.23713435240539024 0.2987779328980942)
(-0.013215038442836169 1.2691426218075141 1.7034783159029394)
(0.012027629138034067 2.892753823819277 3.9511156752107732)
(-0.040153462084081666 -0.8175856484534274 -1.1884679393660296)
(0.026387079538835973 0.714869272123223 1.0219337085296079)
(0.021741370400951646 -0.07189525717161895 -0.060755542465919674)
(0.06561756523337184 -0.18686590621563537 -0.13244611237346374)
(-0.05968859388024361 -0.23906571722260123 0.23617926920226057)
(-0.07315428479950531 -0.3168870905870928 0.3106691315815943)
(-0.04028182125442491 -0.2728858498651283 0.3030891788265941)
(-0.03616393541857673 0.3194605384385623 -0.36716189275282135)
(0.08308734838834235 1.077983412599875 -1.30188696910966)
(0.06671190215882784 -1.4026214213518358 1.7696505600273456)
(-0.0836610971262671 2.0548625773538145 -2.9473536866072982)
(-0.00939190412462424 0.9356826672273441 1.2856039718010903)
(-0.041604018772194835 0.10604190938946734 0.056937120695302774)
(0.014891365561895003 -0.06835300294489667 0.07643317382000685)
(0.017061659794776685 0.09785327809239594 -0.1161220856760713)
(-0.02221686652895126 0.1622633868280973 -0.1940607483581578)
(-0.028314842742249807 -0.24308787793351275 0.2857893091887341)
(0.03394036146648971 -0.32165440856216815 -0.3746583161108063)
(0.08533762786495189 -0.8463223918802393 0.9821708760208421)
(0.07271995514676838 -0.9703740860261354 -1.1718359028320962)
(-0.05628304732446553 -3.2230862671368747 -4.254000078931632)
(0.03367939176628187 3.1137151068490145 -4.150135348093318)
...
(-150.18186114263324 -580.0245293305201 -629.5295754409532));

pMainSeed ( 
(-0.1268621328897278 -0.060237936417147094 0.018193347044096246)
(0.00026685808741542963 0.0005599132762676113 6.628966474867856e-05)
(0.10653968803892358 0.05746152281882491 -0.01981825856015486)
(-0.0023502920985771602 0.00099662625833825 0.00012261349431086547)
(-0.08574505593764135 -0.05017690268299973 -0.020075902680571578)
(0.001942688012017909 0.00017061154741356734 -0.00025652038810285827)
(0.0685530315787625 -0.040763071629455354 -0.017037141555493168)
(0.00039844381472395037 -0.0004457781635435239 1.8933739874599633e-05)
(0.04388604900178739 0.026158644714599263 0.010973980681471453)
(-8.412945267786218e-05 0.000240540309775407 -1.3938067712131777e-06)
(-0.11944618554747323 0.05857546869139171 0.018924950260492353)
(0.0016267474730238076 -8.733406435497346e-05 -0.00024290783151587774)
(-0.07999457567169066 0.0532694232150901 -0.020595384888106638)
(0.0025439473461360967 0.0010128411607937724 4.5848502042820265e-05)
(0.08061049927635192 -0.04868591042799703 0.020851604700474452)
(-0.0008162565445103001 0.0007303290542879323 -8.691909356862863e-05)
(-0.06447203647970279 -0.03960340197487628 0.01771160795800807)
(0.003499196151694326 0.0026132147273215563 0.0011104689239711688)
(-0.04133333496535918 -0.025454896376243773 -0.011428173380724268)
(0.00032790937842114916 0.0005536151908581604 -0.00020275084479191198)
(-0.1118254272107488 -0.05736301494644857 0.020975698241587116)
(-0.0008842202578781576 -0.0009295831815738704 0.0005035260175735386)
(0.09514167325642688 0.05541761372163415 -0.023077637386763834)
(0.0036494020113156285 -0.0007484637846139091 0.0002717664808760839)
(-0.0235997842059489 0.013749983163051874 0.006820796097891529)
(0.011292534987310957 0.005423011262882261 0.0028044508776576033)
(0.061273659209638516 0.039357497906338995 -0.01985132868994952)
(4.2416453484278695e-05 4.070820717000935e-05 -8.713631356182425e-06)
(-0.03922275202422934 0.02523246861108531 0.012778681672739394)
(0.0002679065353016459 0.00019280328560673305 -4.879626766702818e-05)
(0.10649066965391593 -0.056532835414672224 -0.023848883939678975)
(-0.0015130284710580019 -0.00048504829062505394 9.078447691095771e-05)
(-0.08943052358174794 0.05392544578251863 -0.025977267936656643)
(-0.0032489189407957186 0.0006027857788283773 -0.0004436612707975825)
(0.07196770545556415 -0.046873222555598525 0.026187930980452294)
(0.0023821560136113706 0.0004212751006163263 -0.0001361263443029592)
(-0.05751523982473039 -0.03829665342428096 0.022349332312339293)
(0.0006979383867863172 -0.0011340457354526295 -0.0004102996363703738)
(0.03683803223043289 -0.024545051855948748 -0.014384067967049158)
(-0.0005766223892497608 -0.0008350924391249619 0.0004121507819839916)
(0.09393306945748009 0.0508877972752887 -0.024209021948806596)
(-0.000288273953783995 -0.0008221866553483496 0.0006949364958283385)
(0.07886517038544828 0.048544357489280925 0.02638884961293738)
(-0.00017043505092573558 -0.0009711244955578686 0.0006548260813771204)
(0.0634087427358861 -0.04240063213100924 0.026732888801605945)
(-7.405707739863137e-05 0.0030470605312821852 -0.001813980419845184)
(0.050747359388878706 0.034431374396048035 0.022676887417001294)
(-0.00014158287466981196 0.001455722104371907 0.0007779879861430644)
(0.031966350956421745 -0.02186915606601659 -0.014452766456678612)
(0.00042067609819710863 -0.000172068289349072 -8.317997428929323e-05)
(-0.08364244060583216 0.04571808388239166 0.02331070424912906)
(2.8071136482309052e-05 0.0005525572585392681 -0.0005439722824986371)
(-0.07019125288101029 0.043612130118998636 0.025401000978294334)
(-0.0003079139130783919 0.0005713499793607343 -0.0004538359293474696)
(0.05649065010537321 -0.038092573718748496 0.02573432834016865)
(-0.0018725250391018495 0.0034207217715865657 0.002289433464211315)
(-0.045194368996669364 -0.030970391684514584 0.021852532323775938)
(-0.0009410831330612257 0.00010054676490689836 -3.657804668766869e-06)
(0.02892483435468541 -0.01984572266447782 0.014063428732364837)
(0.0001697315259889804 -0.0001756124652029628 -0.00010026713315067093)
(-0.07502608983099272 0.04114247936102212 -0.02162209505372545)
(0.0013415353624153092 -0.0011639940890263761 -0.0009410880355730519)
(0.06294922602054633 -0.03923751753366459 0.023555224222870066)
(0.00028649532532580904 0.0004333505811342727 -0.0004438018338565153)
(0.050706779324858973 -0.034266529334075285 0.023849255625191513)
(0.0008513875043284493 4.6505499308291086e-05 -2.8113295002349096e-07)
(-0.04054188853897649 0.02736935845424537 -0.019907499645554935)
(0.0012227272452175635 -6.56543589414432e-05 -9.170260601707152e-05)
(0.025953711690292387 0.017868012989704186 0.013043620341112309)
(4.302675179813872e-05 -0.0006765511792718093 0.00046476512533358294)
(0.06493681459851568 -0.03564620117815906 0.01891109460008246)
(0.0006646161003379162 0.00019429810615922855 7.540217944128903e-06)
(-0.05451828999507444 -0.034002028952089224 0.02060343127122019)
(-0.00012181379317628991 0.0006098833310269289 0.0005430989006132836)
(0.04388792232221257 -0.029688572552840825 0.020854694568162347)
(-0.0016592094693679916 -0.00033034908285271944 0.00018409907214585636)
(-0.034550545692040455 -0.02414634478836176 0.0177217216447083)
(-0.006086968792105031 -0.006769801069802887 0.004974944129755396)
(0.022463410988650147 0.015480711381821423 -0.011408630158144157)
(0.001009007283969979 0.0005208652065773131 -0.0003904121013208142)
(-0.050858399929925024 -0.02792341801411752 0.014843584169546963)
(-0.00033499598263283457 0.00024046075982570172 -0.0005052284082810452)
(0.0427044138888771 -0.026636735325826846 -0.0161697672726723)
(0.01915500317994124 -0.012342926857605328 -0.008079475455113729)
(-0.034356033428178376 0.02326545758773125 0.0163809562188453)
(-1.5095378183421931e-05 0.000504302385071357 0.0004402706896963206)
(-0.027477485414288568 0.01891437524111858 0.013907775249141371)
(0.00219706124412323 0.0019166282077326584 0.0014362912676606757)
(-0.013553894546342333 0.009104977061575778 0.006732619301764038)
(-0.0003895197649168862 -0.00025230190144467403 0.00018078365414345274)
(-0.031217534212006424 -0.017139241675348107 0.0091101029878086)
(-0.0006473105691534029 -0.00045529676609347766 -0.0002810502534780892)
(0.026211533436371663 -0.016350103252289347 -0.009926612388020518)
(0.0002532004883120821 0.0003830899799840498 0.00029133225877230046)
(-0.021091950423063666 0.014272652479007107 0.010050388352179753)
(0.0008215959262614529 -7.440617505655472e-05 0.00013830825239862808)
(-0.0168494140817205 -0.011604930614563672 -0.008535809614553767)
(-0.00018223926701797322 3.8121969097350143e-06 -1.4465923406676514e-05)
(0.010797518808067022 -0.007432242721141183 0.005488256171433919)
(-0.000184982938713743 -7.622158323952505e-05 -5.8687822838302386e-05)
...
(-2.1645832774508678e-05 5.6369003593246655e-06 -2.9750827400424305e-08));

qMainSeed ( 
(0.0008287326837670582 0.0002475282106381106 9.799714674100402e-06)
(0.11605098501477414 -0.058356919342572186 -0.01853885858107438)
(-2.5767532745871166e-05 -0.0003946929203716582 9.6460115515732e-05)
(-0.0977145510362667 -0.055576802028142434 0.020904413289568418)
(-9.468068908324094e-05 0.0011602675911650392 0.00021072490808950542)
(0.07673736613827965 0.04548795893001119 -0.01877060468957419)
(0.0004283104696319287 0.0018800165230271517 0.0006047266064263867)
(0.05834248194756431 0.03476867896500325 -0.01457740336884834)
(0.00017631716275436947 -0.00032930353038393347 -2.501832564878428e-05)
(-0.024289375452626466 -0.014477209170100907 -0.006074046088230683)
(-0.0031143607708688133 0.002447164718548187 0.0009301199820821414)
(-0.10929000744828225 -0.05679793303672213 -0.01930622502706853)
(-0.06057822643284829 -0.017029508478704592 -0.00136135119365375)
(0.0920232411547781 -0.05408887399763689 -0.021771605618554127)
(-0.0048860425936763175 0.003967558701653126 -0.0015557761054100449)
(-0.07229311098547916 -0.04426506437936923 0.01955061802641458)
(0.0035091009919261465 0.0029683970578578303 -0.0012378736065169428)
(-0.054839222632660514 -0.0337400613045691 -0.01514124661254904)
(-0.00025278849711320373 0.0005436157761722193 0.00014398665100902357)
(-0.022874568783248717 -0.01408088904343336 0.006322675352423342)
(0.018790362732351233 0.009231321524831927 -0.0029723924097435745)
(-0.10372410614314923 -0.05628120590766338 0.021581848024369174)
(-0.004013882717850085 -0.0008395667682942378 -2.8016558184030844e-05)
(0.08728730608503087 0.05360821221731304 -0.024341056099398673)
(0.07291585852487789 -0.04641565924960798 -0.0223615639458441)
(0.06767495521171348 0.04353781632183735 0.021678836737066776)
(0.00034354812550666994 -0.00028145055016153225 5.366298583313153e-05)
(0.05214832769888388 -0.03353774366570075 0.01697467668915161)
(-0.0005149647814194885 -2.3333854372094826e-05 1.4997879434135372e-05)
(0.021708578445228673 -0.013964123252183654 0.0070727578512864864)
(0.0005337921021018252 -0.000407032810844954 -0.0003198424857326753)
(0.09740322307326943 0.05476884567506847 0.024303967961138033)
(0.00022699204082794573 0.0006536698641469635 -0.00047176759121993303)
(0.08198224504233699 0.052164211697027105 -0.0274020455159949)
(0.0010637390580936084 -0.004657469356424483 0.002637955057676554)
(0.06439093910383467 -0.04268906385164861 0.024609716830233642)
(-0.001863953441884698 0.00019715261427013476 -8.181338020080691e-06)
(0.048969611851092686 0.032613676661279054 0.019106224073248464)
(-0.0002411343640203717 0.0005865466581331211 0.0002727095979760973)
(0.020380786671374457 0.013563176854902572 -0.007952250088122528)
(-0.00017625499302511156 0.0003919470781070875 -0.0008802245825430708)
(-0.0859261866635708 -0.04929521099014552 0.024675448832576153)
(-0.0017277275551797553 -0.0001232865628388341 7.237093833570964e-05)
(-0.07237050942744293 -0.04694866667520905 0.02782766091051304)
(0.003158774900796762 -5.588828759848919e-05 0.00012263472219313629)
(0.05683601880980028 -0.03830740451215969 0.024930077968734924)
(0.0010874893133174617 -0.0016968157156935532 -0.0010191461809504793)
(-0.04319870213401351 -0.029338825583083778 -0.019394691064941995)
(0.005834026063514381 -0.003189491985646797 -0.0021529236290666483)
(0.017979520826994336 0.012230792404982205 0.008087356386587623)
(0.0008745652844525203 0.00032713145405607847 0.0006911679619075258)
(0.07651720721281324 0.044289822090365916 -0.023757760664654244)
(0.002768697758350427 0.00021873997725374846 0.0003981646173824399)
(-0.06444497119663464 0.04218411330327737 -0.026792713721879014)
(-0.0022425682880167206 -0.00018270950502625766 0.0002451976234528053)
(-0.05057754403402317 -0.03435441748243831 -0.023953984373487162)
(-0.0007511407938780903 0.00017577433531359488 -6.482114572320101e-05)
(-0.0384568928323604 -0.0263904087030741 -0.01868590234955041)
(0.0008053402211605883 0.0006145358093395201 -0.000313164664315473)
(0.016014143709450333 0.010987900356933256 0.007785304886205083)
(-0.00013581881115153335 0.000284686364547702 -0.0003209901490837499)
(0.06861810871898212 -0.039843198869582354 -0.022015182399516435)
(-0.0026784821467539985 0.0008950327587822989 -0.00020438792121663666)
(-0.05780311531168742 0.03796314481604629 -0.024843290872440485)
(0.00042249899648672695 -0.000978272614797203 0.0008209276807294374)
(-0.04538803398967868 -0.03106891756701804 0.022312681753446167)
(0.00014855003896816377 -0.005265082195422126 0.0037788086788592807)
(0.034482116057067705 -0.023749218741806008 -0.01732636310388468)
(8.376567568858235e-05 -2.69497623387207e-05 -9.985425142142206e-06)
(-0.014364441798188054 0.009866275296983121 -0.007204589996254051)
(-0.00040168091813822215 -0.00014256371657465024 0.0003276048996504141)
(-0.059399229288886655 -0.034534124281377136 0.01927324717833866)
(0.0013198075812522422 0.00036860852499573214 -2.1551107094115284e-05)
(0.0500312735214805 0.032887562119248405 0.021725959238506856)
(-0.00044522029468946784 -0.0008395658672661823 0.0008545840666777538)
(0.0392569424616613 0.02691595367827575 -0.0195150040993934)
(0.006133791114489852 -0.00023106750911322876 0.00021973623392464292)
(0.029237443674157447 0.01943072528556367 -0.014314934476282059)
(0.00016906712365999223 -4.344363587053493e-05 2.417420101392501e-05)
(0.012392018772606163 0.00855231727658739 -0.006302539937495168)
(0.0002390760769722595 -4.0186933442407514e-05 0.00013310870300890375)
(0.04652270264164124 0.027051444744544226 -0.015117742796140829)
(-0.0007382371630595487 7.355968541246274e-05 -0.00011211288505888825)
(-0.03418315112940156 0.022618012958549972 0.015021487086513526)
(0.0011246105942927702 -9.47747892721218e-05 6.413513045592415e-05)
(0.03077316590005276 0.021079996647181624 0.015310271588401054)
(0.0005416757567224599 0.00022811188398831774 0.00022345045028569446)
(0.02328609892604336 0.01600393824355518 0.01180685448592998)
(0.011217344986288574 -0.008009856231328284 -0.0059027897761954355)
(-0.00972965444043456 0.006707072531518289 -0.004952591651010931)
(-6.175820723208239e-05 -0.00015154430292775285 0.0002371152151999826)
(-0.02854937120818251 -0.016599074070262218 -0.009282061703398754)
(-0.0004941899094784365 -4.578643187415182e-05 -0.00011119377063714945)
(0.024050213423435118 0.0158114158913563 0.010467307421224996)
(-0.0005558910702998449 0.0004844804255813322 0.0003570159800839473)
(-0.018870915334695957 -0.01294276765200192 0.009402200445371434)
(0.0008158518852642329 0.0003699678041682898 0.0002479091757956194)
(0.014355496160638165 0.009893698618866189 -0.007301924866023775)
(0.0001856583054172217 -0.0004114834433227206 0.0003093082265452456)
(0.005974052356127576 -0.004119127858977587 -0.0030419702329965983)
...
(-0.0017208825085274636 -0.0017899128726119016 0.0020596946672594156));
